1mem/redeploy/ab_full_log.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.483 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.07 [#/sec] (mean)
Time per request:       482.888 [ms] (mean)
Time per request:       482.888 [ms] (mean, across all concurrent requests)
Transfer rate:          0.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      241  241   0.0    241     241
Processing:   242  242   0.0    242     242
Waiting:      241  241   0.0    241     241
Total:        483  483   0.0    483     483
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.482 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.07 [#/sec] (mean)
Time per request:       482.337 [ms] (mean)
Time per request:       482.337 [ms] (mean, across all concurrent requests)
Transfer rate:          0.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      239  239   0.0    239     239
Processing:   243  243   0.0    243     243
Waiting:      243  243   0.0    243     243
Total:        482  482   0.0    482     482
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.488 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.05 [#/sec] (mean)
Time per request:       487.567 [ms] (mean)
Time per request:       487.567 [ms] (mean, across all concurrent requests)
Transfer rate:          0.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      243  243   0.0    243     243
Processing:   245  245   0.0    245     245
Waiting:      245  245   0.0    245     245
Total:        488  488   0.0    488     488
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   24.551 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    4.07 [#/sec] (mean)
Time per request:       2455.114 [ms] (mean)
Time per request:       245.511 [ms] (mean, across all concurrent requests)
Transfer rate:          1.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      218  240   9.3    241     260
Processing:   248 2061 378.8   2159    2424
Waiting:      240 1217 618.2   1200    2199
Total:        498 2302 377.5   2397    2667

Percentage of the requests served within a certain time (ms)
  50%   2397
  66%   2411
  75%   2423
  80%   2424
  90%   2442
  95%   2448
  98%   2450
  99%   2667
 100%   2667 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.449 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.93 [#/sec] (mean)
Time per request:       2544.851 [ms] (mean)
Time per request:       254.485 [ms] (mean, across all concurrent requests)
Transfer rate:          0.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      221  249  13.7    250     284
Processing:   247 2141 397.9   2241    2452
Waiting:      238 1656 512.8   1747    2330
Total:        496 2390 396.8   2495    2689

Percentage of the requests served within a certain time (ms)
  50%   2495
  66%   2519
  75%   2538
  80%   2548
  90%   2559
  95%   2579
  98%   2604
  99%   2689
 100%   2689 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.819 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.87 [#/sec] (mean)
Time per request:       2581.880 [ms] (mean)
Time per request:       258.188 [ms] (mean, across all concurrent requests)
Transfer rate:          0.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      223  253  25.5    248     374
Processing:   245 2178 411.2   2232    2703
Waiting:      226 1650 555.7   1736    2593
Total:        517 2432 410.1   2482    2948

Percentage of the requests served within a certain time (ms)
  50%   2482
  66%   2528
  75%   2576
  80%   2606
  90%   2704
  95%   2846
  98%   2941
  99%   2948
 100%   2948 (longest request)